src/DataProcessors/Тесты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>Тесты</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаемыйРезультат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолученныйРезультат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тесты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ФорматыОтветаФункцииПроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ФорматыОтветаФункцииПроверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Соответствие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокаJSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокаJSONБезСпецСимволов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Тесты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Тесты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗапускать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/Тесты/Forms/Форма/Ext/Form/Module.bsl
#Область Тесты
Процедура Тест1()
	
	ФорматОтвета = Перечисления.ФорматыОтветаФункцииПроверки.СтрокаJSONБезСпецСимволов;
	
	Объект.Результаты.Очистить();
	
	Валидатор = Обработки.Валидатор.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тесты.Схема КАК Схема,
		|	Тесты.Данные КАК Данные,
		|	Тесты.ОжидаемыйРезультат КАК ОжидаемыйРезультат,
		|	Тесты.Наименование КАК Наименование,
		|	Тесты.Описание КАК Описание,
		|	Тесты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Тесты КАК Тесты
		|ГДЕ
		|	НЕ Тесты.ЭтоГруппа
		|	И НЕ Тесты.НеЗапускать";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПолученныйРезультат	= ВалидацияЗначенийКлиентСервер.ПроверитьСоответствиеСхеме(Выборка.Схема, Выборка.Данные, ФорматОтвета);	
		ОжидаемыйРезультат	= СтроковыеФункцииКлиентСервер.СтрокаБезСпецСимволов(Выборка.ОжидаемыйРезультат);
					
		НоваяСтрока = Объект.Результаты.Добавить();
		НоваяСтрока.Тест =  Выборка.Ссылка;
		НоваяСтрока.Схема = Выборка.Схема;
		НоваяСтрока.Данные = Выборка.Данные;
		НоваяСтрока.ОжидаемыйРезультат = ОжидаемыйРезультат;
		НоваяСтрока.ПолученныйРезультат = ПолученныйРезультат;
		НоваяСтрока.Успех = (ОжидаемыйРезультат = ПолученныйРезультат); 		
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти



&НаСервере
Процедура ЗапускТестовНаСервере()
	
	Тест1();	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускТестов(Команда)
	ЗапускТестовНаСервере();
КонецПроцедуры
